---
kind: other
id: Properties.T:Autodesk.Revit.DB.Architecture.StairsComponentConnection
source: html/f743a234-6afe-b7c0-ba3d-2ce95d5fbea3.htm
---
# StairsComponentConnection Properties

The connection type of the connected stairs component.